blank/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (14 0 0);

boundaryField
{
    inlet
    {
		type  			fixedValue;
		value 			$internalField;
    }
	
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }

    upperWall
	{
		type 			noSlip;
	}

	frontAndBack
	{
		type 			noSlip;
	}
	
	ahmedBody
    {
        type            noSlip;
    }
	
	/*
	roofRack
	{
        type            noSlip;
    }
	*/

}


// ************************************************************************* //
