blank/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.4704;

boundaryField
{
	inlet
	{
		type 	 		fixedValue;
		value 			$internalField;
	}

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    upperWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

	frontAndBack
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	
    ahmedBody
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	
	/*
	roofRack
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	*/

}


// ************************************************************************* //
