blank/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/
forces
{
    patches		    (ahmedBody); // ("ahmedBody" "roofRack");
	CofR		    (-10 0 0);
	pitchAxis	    (0 1 0);
    liftDir         (0 0 1);
    dragDir         (1 0 0);	pitchAxis	(0 1 0);
	rho             rhoInf;
	rhoInf		    1;  //1.225;
	type            forces;
	libs            ("libforces.so");
	writeControl    timeStep;
	writeInterval   1;
	timeStart       0; //$timeStart;
	timeEnd         100000; 
	log             on;
}
